// * Пару слов о var
/*
* Разница в уровне охвата
* Var – Оператор переменных JavaScript используется для объявления переменной и, при желании, мы можем инициализировать значение этой переменной.

* Const – идея константных функций не позволяет им изменять объект, для которого они вызываются. Когда функция объявлена ​​как const, ее можно вызывать для любого типа объекта.

* Let – это сигнал о том, что переменная может быть переназначена, например, счетчик в цикле или замена значения в алгоритме. Он также сигнализирует, что переменная будет использоваться только в блоке, в котором она определена.
*/

// carName = 'Volvo';

// console.log(carName);

// var carName;

// А вот так undefined

// console.log(carName);

// carName = 'Volvo';

// var carName;
